In [1]:
import pandas as pd
import numpy as np

a = pd.Series(np.arange(3), index=['a', 'b', 'c'])
b = pd.Series(np.arange(5, 8), index=[ 'b', 'c', 'd'])
c = a.add(b,fill_value= 0)
c

a    0.0
b    6.0
c    8.0
d    7.0
dtype: float64

In [3]:
frame = pd.DataFrame(np.arange(12.0).reshape(4, 3), columns=list('abc'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          a     b     c
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [4]:
frame.iloc[0, :]

a    0.0
b    1.0
c    2.0
Name: Utah, dtype: float64

In [5]:
frame2 = pd.DataFrame(np.arange(18., 30.).reshape(4, 3), columns=list('abc'), index=[ 'Ohio', 'Texas', 'Oregon', 'New York'])
frame2

             a     b     c
Ohio      18.0  19.0  20.0
Texas     21.0  22.0  23.0
Oregon    24.0  25.0  26.0
New York  27.0  28.0  29.0

In [6]:
frame + frame2

             a     b     c
New York   NaN   NaN   NaN
Ohio      21.0  23.0  25.0
Oregon    33.0  35.0  37.0
Texas     27.0  29.0  31.0
Utah       NaN   NaN   NaN

In [7]:
frame.add(frame2, fill_value= 0.)

             a     b     c
New York  27.0  28.0  29.0
Ohio      21.0  23.0  25.0
Oregon    33.0  35.0  37.0
Texas     27.0  29.0  31.0
Utah       0.0   1.0   2.0

In [8]:
series = frame.iloc[0]
frame - series

          a    b    c
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [9]:
frame + series

          a     b     c
Utah    0.0   2.0   4.0
Ohio    3.0   5.0   7.0
Texas   6.0   8.0  10.0
Oregon  9.0  11.0  13.0

In [10]:
series.min()
series.max()

2.0

In [2]:
frame = pd.DataFrame(np.arange(12.).reshape(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
serie = frame.iloc[0]
serie

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [3]:
d = frame['d']
frame.sub(d, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [17]:
# apply
frame.apply(lambda x : x.max() - x.min())
frame.apply(lambda x : x.max() - x.min(), axis="columns")

Utah      2.0
Ohio      2.0
Texas     2.0
Oregon    2.0
dtype: float64

In [21]:
#sort_index
frame.sort_index()
frame.sort_index(ascending=False)
frame.sort_index(axis=1, ascending=False) # sort by b d e

           e     d    b
Utah     2.0   1.0  0.0
Ohio     5.0   4.0  3.0
Texas    8.0   7.0  6.0
Oregon  11.0  10.0  9.0

In [5]:
# Default sort_values used in series
frame['b'].sort_values()
frame.sort_values(by='e')
frame['b'].rank(method='max')

Utah      1.0
Ohio      2.0
Texas     3.0
Oregon    4.0
Name: b, dtype: float64

In [9]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [11]:
obj.rank(method='max')

0    7.0
1    1.0
2    7.0
3    5.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [29]:
# stats
frame.sum()
frame.sum(axis=1, skipna=True)

Utah       3.0
Ohio      12.0
Texas     21.0
Oregon    30.0
dtype: float64